Repository: markemer/Chalk
Catalog: Chalk/*.lproj/Localizable.strings
Languages: fr

source: File access error
fr: Erreur d'accès au fichier

# __FILE_ACCESS_PROBLEM_INFORMATION__
source: Access to file <%@> failed. This is certainly a Catalina "security" decision, and you have to manually delete this file to restart it from scratch.
fr: L'accès au fichier <%@> a échoué. Il s'agit certainemlent d'une décision de "securité" de Catalina, et vous devez supprimer manuellement ce fichier pour le recréer de zéro.

source: output
fr: sortie

source: output from bits inspector
fr: sortie de l'inspecteur de bits

source: type any custom annotation here
fr: entrez ici une annotation personnalisée

source: Page Setup…
fr: Format d'impression…

source: Print…
fr: Imprimer…

source: Font
fr: Police

source: Bigger
fr: Plus grand

source: Smaller
fr: Plus petit

source: Hide Toolbar
fr: Masquer la barre d'outils

source: Show Toolbar
fr: Afficher la barre d'outils

source: Constants manager
fr: Gestionnaire de constantes

source: Show constants manager
fr: Afficher le gestionnaire de constantes

source: Hide constants manager
fr: Masquer le gestionnaire de constantes

source: Show compute inspector
fr: Afficher l'inspecteur de calcul

source: Hide compute inspector
fr: Masquer l'inspecteur de calcul

source: Show variables inspector
fr: Afficher l'inspecteur de variables

source: Hide variables inspector
fr: Masquer l'inspecteur de variables

source: Show bits inspector
fr: Afficher l'inspecteur de bits

source: Hide bits inspector
fr: Masquer l'inspecteur de bits

source: Show axes inspector
fr: Afficher l'inpecteur des axes

source: Hide axes inspector
fr: Masquer l'inspecteur des axes

source: Chalk help
fr: Aide de Chalk

source: Chalk quick help
fr: Aide rapide de Chalk

source: Add selection to current calculator document
fr: Ajouter la sélection au document de calculette actuel

source: Theme
fr: Thème

# Exact mode, does not accept rounding or approximations
source: Exact mode, does not accept rounding or appoximations
fr: Mode exact, qui ne tolère pas les arrondis ou les approximations

source: Approximation mode, exact as long as possible but performs approximations when needed
fr: Mode approximation, exact autant que possible, mais qui se résout aux approximations si nécessaire

source: Interval mode, exact as long as possible but performs approximations when needed, and reports uncertainty
fr: Mode intervalles, exact autant que possible, mais qui se résout aux approximations si nécessaire, et affiche l'incertitude

source: Press alt(⎇) and shift(⇧) to change computation mode
fr: Appuyez sur alt(⎇) et majuscule(⇧) pour changer le mode de calcul mode

# __DISPLAY_BITS__
source: Display bits can be less than the significand bits count used in computations to limit the size of the result
fr: Les bits d'affichage peuvent être moins nombreux que les bits significatifs utilisés lors du calcul pour limiter la taille du résultat

source: Graph background color
fr: Couleur d'arrière plan du graphique

# Graph font
source: Graph dont
fr: Police du graphique

source: No action
fr: Pas d'action

source: Move by dragging
fr: Déplacement par clic-glisser

source: Zoom in
fr: Zoom

source: Zoom out
fr: Dézoom

source: Center axe
fr: Centrer l'axe

source: Snapshot
fr: Capture

source: Copy PDF to clipboard
fr: Copier en PDF dans le presse-papier

source: Copy PNG to clipboard
fr: Copier en PNG dans le presse-papier

source: Create PDF file on desktop
fr: Créer un fichier PDF sur le bureau

source: Create PNG file on desktop
fr: Créer un fichier PNG sur le bureau

source: Draw uncertainty
fr: Colorier l'incertitude

source: Draw NaN as uncertainty
fr: Colorier NaN comme une incertitude

source: Thickness
fr: Épaisseur

source: Curve color
fr: Couleur de la courbe

source: Curve interior color
fr: Couleur intérieure de la courbe

source: Predicate <true> color
fr: Couleur <vrai> du prédicat

source: Predicate <false> color
fr: Couleur <faux> du prédicat

# DRAW_NAN_AS_UNCERTAINTY_TOOLTIP
source: NaN (Not A Number) is emitted when a computation is invalid and cannot give any result, for instance the logarithm of a negative value
fr: NaN (Not A Number) est émis quand un calcul est invalide et ne peut pas donner de résultat, comme le logarithme d'une valeur négative.

source: all
fr: tout

# All_fem
source: All
fr: toutes

source: An error occured while trying to reach %@. You should check your network.
fr: Une erreur est survenue en essaynt d'accéder à %@. Vous devriez vérifier votre réseau.

source: Apply to
fr: Appliquer à

source: Automatically check updates
fr: Vérifier automatiquement les mises à jour

source: x axis
fr: axe x

source: y axis
fr: axe y

source: Cancel
fr: Annuler

source: Certainly
fr: Certainement

source: integer
fr: entier

source: chalk integer
fr: entier chalk

source: chalk real
fr: flottant chalk

source: Check now...
fr: Vérifier maintenant...

source: convert to
fr: convertir en

source: custom signed integer
fr: entier signé personnalisé

source: custom unsigned integer
fr: entier non signé personnalisé

source: defaults
fr: réinitialiser

source: denominator
fr: dénominateur

source: Digits in base
fr: Chiffres en base

source: Display
fr: Afficher

source: Do not remove
fr: Ne pas effacer

source: Do you really want to remove all entries ?
fr: Voulez-vous vraiment effacer toutes les entrées ?

source: Dynamic
fr: Dynamique

source: Edition
fr: Édition

source: Error
fr: Erreur

source: exponent
fr: exposant

source: Functions
fr: Fonctions

source: Function
fr: Fonction

source: General
fr: Général

source: Grid
fr: Grille

source: Group digits by
fr: Chiffres groupés par

source: Copy the image as
fr: Copier l'image comme

source: Input...
fr: Entrée...

source: Output...
fr: Sortie...

source: Copy to clipboard as PDF
fr: Copier dans le presse-papier comme PDF

source: Copy to clipboard as SVG
fr: Copier dans le presse-papier comme SVG

source: Copy to clipboard as string
fr: Copier dans le presse-papier comme chaîne de caractères

source: Render
fr: Effectuer le rendu

source: interpret as
fr: interpréter en

source: linear
fr: linéaire

source: logarithmic
fr: logarithmique

source: lower bound
fr: borne inférieure

source: Maybe
fr: Peut-être

source: Name
fr: Nom

source: Definition
fr: Définition

source: No
fr: Non

source: numerator
fr: numerateur

source: Output base
fr: Base de destination

source: overflow
fr: dépassement

source: Overflow
fr: Dépassement

source: Preferences
fr: Préférences

source: Computation limits
fr: Limite des calculs

source: Computation behaviour
fr: Comportement des calculs

source: Prefixes
fr: Préfixes

source: Raise error on NaN
fr: Lever une erreur en cas de NaN

source: Remove
fr: Effacer

source: sign
fr: signe

source: signed int128
fr: int128 signé

source: signed int16
fr: int16 signé

source: signed int256
fr: int256 signé

source: signed int32
fr: int32 signé

source: signed int64
fr: int64 signé

source: signed int8
fr: int8 signé

source: significand
fr: mantisse

source: Digits displayed
fr: Chiffres affichés

# Soft float display bits
source: Float display bits
fr: Bits d'affichage flottants

# Soft float significand bits
source: Float compute bits
fr: Bits de calculs flottants

# Soft max integer bits
source: Integer compute bits
fr: Bits de calculs entiers

# Soft max integer denominator bits
source: Denominator compute bits
fr: Bits de calculs dénominateur

source: Parsing and interpretation
fr: Interprétation

source: Bits inspector
fr: Inspecteur de bits

source: This cannot be undone
fr: Cette opération ne peut être annulée

source: underflow
fr: soupassement

source: Unlikely
fr: Invraisemblablement

source: unsigned int128
fr: int128 non signé

source: unsigned int16
fr: int16 non signé

source: unsigned int256
fr: int256 non signé

source: unsigned int32
fr: int32 non signé

source: unsigned int64
fr: int64 non signé

source: unsigned int8
fr: int8 non signé

source: Untitled
fr: Sans titre

source: upper bound
fr: limite supérieure

source: Use decimal exponent
fr: Utiliser un exposant décimal

source: Use lowercase
fr: Utiliser des minuscules

source: value
fr: valeur

source: Value
fr: Valeur

source: Values
fr: Valeurs

source: Visit web site...
fr: Visiter le site web...

source: f(x) curve or f(x,y) predicate
fr: courbe f(x) ou prédicat f(x,y)

source: Element size
fr: Taille élémentaire

source: Yes
fr: Oui

source: reverse bits
fr: renversement des bits

source: swap pairs of bits packets
fr: échange de paires de paquets de bits

source: base 2 (1 bit per digit)
fr: base 2 (1 bit par chiffre)

source: base 4 (2 bits per digit)
fr: base 4 (2 bits par chiffre)

source: base 8 (3 bits per digit)
fr: base 8 (3 bits par chiffre)

source: base 16 (4 bits per digit)
fr: base 16 (4 bits par chiffre)

source: base 32 (5 bits per digit)
fr: base 32 (5 bits par chiffre)

source: To most significand bits
fr: Vers les bits les plus significatifs

source: To most significand set bit
fr: Vers le bit à 1 le plus significatif

source: To next group of bits
fr: Vers le prochain groupe de bits

source: To least significand bits
fr: Vers les bits les moins significatifs

source: To least significand set bit
fr: Vers le bit à 1 le moins significatif

source: To previous group of bits
fr: Vers le groupe de bits précédent

source: No error
fr: Pas d'erreur

source: Unknown error
fr: Erreur inconnue

source: Syntax error
fr: Erreur de syntaxe

source: Non implemented
fr: Non implementé

source: Not enough memory
fr: mémoire insuffisante

source: Undefined identifier
fr: Identificateur non défini

source: Undefined function identifier
fr: Identificateur de fonction non défini

source: Identifier is reserved
fr: Identificateur réservé

source: Integer overflow
fr: Dépassement d'entier

# Integer overflow. You might have to consider increasing the integer bits limit.
source: Integer overflow. You might have to consider increasing the integer bits limit, or compute in an approximation mode
fr: Dépassement d'entier. Vous pourriez envisager d'augmenter le nombre de bits de calculs d'entiers, ou calculer dans un mode avec approximations

source: Unknown operator
fr: Opérateur inconnu

source: Invalid operands
fr: Opérandes invalides

source: Invalid operands count
fr: Mauvais nombre d'opérandes

source: Operation non implemented
fr: Opération non implémentée

source: Malformed matrix
fr: Matrice mal formée

source: Matrix is not invertible
fr: Matrice non inversible

source: Dimensions mismatch
fr: Incompatibilité des dimensions

source: Invalid numeric operation
fr: Opération numérique invalide

source: Division by zero
fr: Division par zéro

source: Unsupported number
fr: Nombre non supporté

source: Internal overflow
fr: Dépassement interne

source: Internal underflow
fr: Soupassement interne

source: Internal precision overflow
fr: Dépassement interne de la précision

source: Internal initialization failed
fr: Échec interne d'initialisaiton

source: Invalid base
fr: Base invalide

source: Base identifiers are ambiguous
fr: Ambiguïté dans les dentificateurs de base

source: Base identifier conflict
fr: Conflit d'identificateur de base

source: Invalid base identifier
fr: Identificateur de base invalide

source: Invalid digits for base
fr: Chiffres invalides pour la base

source: Cannot open data
fr: Les données ne peuvent être ouvertes

source: Cannot read data
fr: Les données ne peuvent être lues

source: Cannot write data
fr: Les données ne peuvent être écrites

source: No possible representation
fr: Aucune représentation possible

source: Unexpected sign
fr: Signe inattendu

source: Unexpected exponent
fr: Exposant inattendu

source: Unexpected significand
fr: Mantisse inattendue

source: Unsupported sign
fr: Signe non supporté

source: Unsupported exponent
fr: Exposant non supporté

source: Unsupported significand
fr: Mantisse non supportée

source: Unsupported infinity
fr: Infini non supporté

source: Unsupported NaN
fr: NaN non supporté

source: User cancellation
fr: Interruption par l'utilisateur

source: Infix notation (standard)
fr: Notation infixée (standard)

source: Reverse Polish notation (RPN)
fr: Notation Polonaise inverse (NPI/RPN)

source: Expression (RPN mode)
fr: Expression (mode NPI/RPN)

source: Prepare next input
fr: Préparation de l'entrée suivante

source: Empty
fr: Vide

source: Previous input
fr: Entrée précédente

source: output(1) on first operator
fr: output(1) au premier opérateur

source: Parse mode :
fr: Mode d'interprétation :

source: Color for sign bits
fr: Couleur des bits de signe

source: Color for exponent bits
fr: Couleur des bits d'exposant

source: Color for significand bits
fr: Couleur des bits de mantisse

source: set to 0
fr: mise à 0

source: set to 1
fr: mise à 1

source: one's complement
fr: complément à 1

source: two's complement
fr: complément à 2

source: left shift
fr: décalage vers la gauche

source: right shift
fr: décalage vers la droite

source: left roll
fr: roulement vers la gauche

source: right roll
fr: roulement vers la droite

source: increment by 1
fr: incrémenter de 1

source: decrement by 1
fr: décrémenter de 1

source: Categories
fr: Catégories

source: Load
fr: Charger

source: Uncertainty
fr: Incertitude

source: Units
fr: Unités

source: Symbol
fr: Symbole

source: author
fr: auteur

source: You could take a pen and a paper. You are just lazy today.
fr: Vous pourriez prendre un papier et un crayon. Vous êtes juste en train de faire votre grosse feignasse aujourd'hui.
